{"format": "layers-model", "generatedBy": "keras v2.8.0", "convertedBy": "TensorFlow.js Converter v4.1.0", "modelTopology": {"keras_version": "2.8.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 48, 48, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "input_1"}}, {"class_name": "Conv2D", "config": {"name": "conv2d", "trainable": true, "dtype": "float32", "filters": 512, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_1", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_1", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_2", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_2", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_3", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "BatchNormalization", "config": {"name": "batch_normalization_3", "trainable": true, "dtype": "float32", "axis": [3], "momentum": 0.99, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_1", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Conv2D", "config": {"name": "conv2d_4", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "MaxPooling2D", "config": {"name": "max_pooling2d_2", "trainable": true, "dtype": "float32", "pool_size": [2, 2], "padding": "valid", "strides": [2, 2], "data_format": "channels_last"}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "trainable": true, "dtype": "float32", "rate": 0.5, "noise_shape": null, "seed": null}}, {"class_name": "Flatten", "config": {"name": "flatten", "trainable": true, "dtype": "float32", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense", "trainable": true, "dtype": "float32", "units": 4, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Adam", "config": {"name": "Adam", "learning_rate": 9.999999747378752e-06, "decay": 0.0, "beta_1": 0.8999999761581421, "beta_2": 0.9990000128746033, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"name": "batch_normalization/gamma", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.17313450574874878, "scale": 3.0473220482055916e-05, "original_dtype": "float32"}}, {"name": "batch_normalization/beta", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2893119758368903, "scale": 9.474145326551079e-06, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_mean", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0, "scale": 1.5427835784187996e-05, "original_dtype": "float32"}}, {"name": "batch_normalization/moving_variance", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 7.006492321624085e-44, "scale": 3.2985193138038155e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_1/gamma", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.7018471360206604, "scale": 1.2012335476853841e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_1/beta", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.12679512427706663, "scale": 8.328086980431306e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_mean", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 7.006492321624085e-44, "scale": 9.268767738938923e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_1/moving_variance", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 7.006492321624085e-44, "scale": 0.0004549924501649137, "original_dtype": "float32"}}, {"name": "batch_normalization_2/gamma", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.6382859349250793, "scale": 1.4287754955831632e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_2/beta", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.17692560805325433, "scale": 7.13380944531488e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_mean", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.32415691018104553, "scale": 0.00020590462009412177, "original_dtype": "float32"}}, {"name": "batch_normalization_2/moving_variance", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 2.2329511642456055, "scale": 0.006902701148745251, "original_dtype": "float32"}}, {"name": "batch_normalization_3/gamma", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.4560963213443756, "scale": 4.492412581545288e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_3/beta", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.0019411817026015693, "scale": 2.8297109367369814e-06, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_mean", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 0.9420011043548584, "scale": 4.687136822309994e-05, "original_dtype": "float32"}}, {"name": "batch_normalization_3/moving_variance", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": 15.714730262756348, "scale": 0.001362454315485903, "original_dtype": "float32"}}, {"name": "conv2d/kernel", "shape": [3, 3, 3, 512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2941517358014683, "scale": 1.1525418689815386e-05, "original_dtype": "float32"}}, {"name": "conv2d/bias", "shape": [512], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.04792170178301776, "scale": 3.590716453095891e-06, "original_dtype": "float32"}}, {"name": "conv2d_1/kernel", "shape": [3, 3, 512, 256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.727426993715924, "scale": 2.09590858822694e-05, "original_dtype": "float32"}}, {"name": "conv2d_1/bias", "shape": [256], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.253767892271519, "scale": 6.089649939324223e-06, "original_dtype": "float32"}}, {"name": "conv2d_2/kernel", "shape": [3, 3, 256, 128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.6263163667462953, "scale": 1.670444249069972e-05, "original_dtype": "float32"}}, {"name": "conv2d_2/bias", "shape": [128], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.5713855088575669, "scale": 1.015002502678024e-05, "original_dtype": "float32"}}, {"name": "conv2d_3/kernel", "shape": [3, 3, 128, 64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.5106505276819039, "scale": 1.456837064024603e-05, "original_dtype": "float32"}}, {"name": "conv2d_3/bias", "shape": [64], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.2967234788913153, "scale": 6.658217859111753e-06, "original_dtype": "float32"}}, {"name": "conv2d_4/kernel", "shape": [3, 3, 64, 32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.5005638585607601, "scale": 1.2498161308350857e-05, "original_dtype": "float32"}}, {"name": "conv2d_4/bias", "shape": [32], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.4468892812728882, "scale": 6.379590332030595e-06, "original_dtype": "float32"}}, {"name": "dense/kernel", "shape": [1152, 4], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.29452927811354784, "scale": 9.132690794218538e-06, "original_dtype": "float32"}}, {"name": "dense/bias", "shape": [4], "dtype": "float32", "quantization": {"dtype": "uint16", "min": -0.37448273762108997, "scale": 1.4726601031149081e-05, "original_dtype": "float32"}}]}]}